tests/performance/stress-tests/spike-test.yml
config:
  target: "http://localhost:8080"
  phases:
    - duration: 30
      arrivalRate: 5
      name: "Baseline"
    - duration: 10
      arrivalRate: 500
      name: "Sudden spike - 500 users"
    - duration: 60
      arrivalRate: 5
      name: "Recovery period"
  processor: "./test-helpers.js"
  plugins:
    metrics-by-endpoint:
      stripQueryString: true

scenarios:
  - name: "Spike Load Test"
    flow:
      - get:
          url: "/api/v1/products"
      - think: 1
      - post:
          url: "/api/v1/auth/login"
          json:
            email: "spiketest@example.com"
            password: "Test@1234"
          capture:
            - json: "$.token"
              as: "authToken"
      - get:
          url: "/api/v1/users/profile"
          headers:
            Authorization: "Bearer {{ authToken }}"